
## Plan Result (dev)

[CI link](https://github.com/takoikatakotako/rikako/actions/runs/23086626607)


<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.cognito.aws_cognito_user_pool.main
  * module.cognito.aws_cognito_user_pool_client.main
* Update
  * module.lambda.aws_lambda_function.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cognito.aws_cognito_user_pool.main will be created
  + resource "aws_cognito_user_pool" "main" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "rikako-development"
      + region                     = "ap-northeast-1"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Project"     = "rikako"
        }
      + tags_all                   = {
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Project"     = "rikako"
        }
      + user_pool_tier             = (known after apply)
      + username_attributes        = [
          + "email",
        ]

      + admin_create_user_config {
          + allow_admin_create_user_only = false
        }

      + email_configuration {
          + email_sending_account = "COGNITO_DEFAULT"
        }

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = true
          + require_uppercase                = true
          + temporary_password_validity_days = (known after apply)
        }

      + sign_in_policy (known after apply)

      + sms_configuration (known after apply)

      + username_configuration (known after apply)

      + verification_message_template (known after apply)
    }

  # module.cognito.aws_cognito_user_pool_client.main will be created
  + resource "aws_cognito_user_pool_client" "main" {
      + access_token_validity                         = 1
      + allowed_oauth_flows                           = (known after apply)
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = (known after apply)
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = [
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
      + generate_secret                               = false
      + id                                            = (known after apply)
      + id_token_validity                             = 1
      + logout_urls                                   = (known after apply)
      + name                                          = "rikako-mobile-development"
      + prevent_user_existence_errors                 = (known after apply)
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = 30
      + region                                        = "ap-northeast-1"
      + supported_identity_providers                  = (known after apply)
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)

      + token_validity_units {
          + access_token  = "hours"
          + id_token      = "hours"
          + refresh_token = "days"
        }
    }

  # module.lambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "rikako-api-development"
        tags                           = {
            "Environment" = "development"
            "ManagedBy"   = "terraform"
            "Project"     = "rikako"
        }
        # (31 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "AWS_LWA_READINESS_CHECK_PATH"     = "/health"
              - "AWS_LWA_READINESS_CHECK_PORT"     = "8080"
              - "AWS_LWA_READINESS_CHECK_PROTOCOL" = "http"
              - "DATABASE_URL"                     = (sensitive value)
              - "ENVIRONMENT"                      = "development"
              - "IMAGE_BASE_URL"                   = "https://d1ovm6exq28tn1.cloudfront.net"
              - "PORT"                             = "8080"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + cognito_client_id          = (known after apply)
  + cognito_user_pool_endpoint = (known after apply)
  + cognito_user_pool_id       = (known after apply)
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":62,"Program":"tfcmt","SHA1":"f1bcb1a50e854ba0ec860cdd9173a8891a5f044f","Target":"dev","Vars":{},"WorkflowName":"Terraform Plan"} -->